// Task 1

// let i = 0;
// while (i <= 10) {
//     if (i % 1 === 0) {
//         console.log(i);
        
//     }

//     i += 1;
// }

// task 2 Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

// Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
// let num = 7;

// for (let i = 0; i <= 10; i += 1) {
//     console.log(`${num} X ${i} = ${num * i}`);
    
// }

// Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

for (let n = 0; n < 20; n += 1) {
    console.log(n);
    
}