// Task 1

let ok = 0;
while (ok <= 10) {
    if (ok % 1 === 0) {
        console.log(ok);
        
    }

    ok += 1;
}

// task 2 Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

for (let i = 0; i <= 20; i += 1) {
     if (i % 2 !== 0) {
         continue;
    }
    console.log(i);
    
 }

// task 3 Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
let num = 7;

for (let i = 0; i <= 10; i += 1) {
    console.log(`${num} X ${i} = ${num * i}`);
    
}

// Task 4 Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

for (let n = 0; n < 20; n += 1) {
    console.log(n);
    
}

// Task 5 За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

let i = 0;
while (i <= 20) {
    console.log(i);
    i += 1
      if (i % 3 === 0) {
          continue;
     }
}